
function getArray(){
arrAnimals = 
[
    /* ------------------------куницы--------------------------------------------- */
    [
        [
            'Нилгирийская куница', 'images/MartesGwatkinsii.png',
            '(лат. Martes gwatkinsii) является хищным млекопитающим из семейства куньих. Она отличается ' +
            'своим внушительным размером, достигая длины от 55 до 70 см. Длина хвоста составляет от 40 до 45 см, ' +
            'а вес колеблется от 2 до 2,5 кг. Этот вид куницы встречается только в южной Индии'
        ],
        [
            'Ласка', 'images/laska.png',
            '(лат. Mustela nivalis) – это маленькое млекопитающее из рода ласок и хорьков. С их длиной тела ' +
            'до 26 см и хвостом не более 9 см, они являются одними из самых маленьких хищников. ' +
            'Ласки имеют тонкое и гибкое тело, маленькую голову и сильно укороченные лапы. Их мех густой и короткий. ' +
            'Ласки обитают в различных регионах, включая тундру, леса и степи Старого и Нового Света.'
                            
        ],
        [

            'Горностай', 'images/gornostay.png',
            '(лат. Mustela erminea) – это вид млекопитающего из семейства меховых. Они достигают длины около ' +
            '15 – 31 сантиметра, с хвостом примерно 7-13 сантиметров. Окраска шерсти может быть коричневой летом ' +
            'и белой зимой. Горностаи обитают в лесах, горах и полупустынях Евразии и Северной Америки. Они питаются ' +
            'грызунами, птицами, земляными червями и насекомыми.'
        ],
        [
            'Медоед', 'images/medoed.png',
            '(лат. Mellivora capensis) - вид из семейства куньих. Самый отмороженный зверь Африки. При собственном весе в 10 кг, он решается вступать ' +
            'в схватку со львом. Книга рекордов Гиннесса в своих изданиях за 1998–2003 годы провозгласила медоеда «самым ' +
            'бесстрашным млекопитающим в мире».'
                            
        ],
        [
            'Барсук', 'images/barsuk.png',
            '(лат. Meles meles) – это вид морской хищной млекопитающей, обитающий в Европе и некоторых частях Азии. Барсук ' +
            'имеет большую и компактную конструкцию тела с короткими ногами и широкой головой. Окраска его шерсти может быть ' +
            'серо-коричневой или черной. Барсуки активны ночью и питаются насекомыми, грызунами, птицами и яйцами. Они также могут ' +
            'причинять ущерб сельскохозяйственным культурам и садам. '
        ],
        [
            'Колонок', 'images/kolonok.png',
            '(лат. Mustela sibirica) является видом млекопитающих из семейства куньих. Они обитают в Северной Азии, включая Россию, ' +
            'Китай и Монголию. У колонков короткая шерсть, окрашенная в коричневые и желтоватые оттенки. Они активны ночью и ведут ' +
            'одиночный образ жизни. Колонки питаются грызунами, птицами и рептилиями.'
        ],
        [
            'Харза', 'images/harza.png',
            '(лат. Martes flavigula) является млекопитающим из семейства куньих. Они обитают в Юго-Восточной Азии, включая Индию, ' + 
            'Китай и Индонезию. У них есть длинная шерсть, окрашенная в коричневые и черные оттенки. Они активны ночью и ведут ' + 
            'одиночный образ жизни. Харзы питаются разнообразной добычей, включая грызунов, птиц и фрукты.'
        ]
    ],
    /* ------------------------куницы--------------------------------------------- */
    /* ------------------------кошки---------------------------------------------- */
    [
        [
            'Манул', 'images/manul.png',
            'Широкая голова с высоко посаженными глазами и низко расположенными ушами протискивается в скалистые выступы, где живут ' +
            'грызуны и птицы.'
        ],
        [
            'Рысь', 'images/rys.png',
            'По величине рысь — сравнительно небольшая кошка в сравнении с другими хищниками. Она представляет собой животное с ' +
            'коротким, сбитым туловищем. Голова круглая, уши с черными кисточками на кончиках. Голова большая, глаза желтые, ' +
            'на щеках шерсть более длинная, похожа на бакенбарды. Носовая часть широкая. Хвост короткий, тупой, длиной 25-30 см. '
        ],
        [
            'Сервал', 'images/serval.png',
            'Стройная кошка с длинной шеей, маленькой головой и большими, слегка чашевидными ушами. Взрослые в длину от 80 до 100 см, ' +
            'на хвост приходится еще 20–30 см.'
        ],
        [
            'Каракал', 'images/karakal.png',
            'Другим названием животного принято считать «степная рысь». Дикая кошка имеет средний размер, и долгое время относилась ' +
            'к рысям. В наше время встретить хищника можно на территории Африки, Азии, Казахстана и центральной Индии. Животные ' +
            'предпочитают обитать в зарослях, лесистых местностях, скалистых склонах и равнинах. Самыми благоприятными регионами ' +
            'считаются луговые переходы. Найти степную рысь можно на высоте более 3000 метров.'
        ]

    ],
    /* ------------------------кошки---------------------------------------------- */
    /* ------------------------медведи-------------------------------------------- */
    [
        [

        ]

    ],
    /* ------------------------медведи-------------------------------------------- */
    /* ------------------------еноты---------------------------------------------- */
    [
        [

        ]

    ]
    /* ------------------------еноты---------------------------------------------- */
]
}